# Dataframe Group By

In [41]:
import pandas as pd
import numpy as np
# Create Data
stuff = {
    'Corporation':['Apple', 'Google', 'Meta', 'Apple', 'Google','Meta'],
    'Employees':['John', 'April', 'Wes', 'Beth', 'Justin', 'Steph'],
    'Salary':[200, 220, 190, 130, 120, 150]}
# Create Dataframe
df = pd.DataFrame(stuff)
df

  Corporation Employees  Salary
0       Apple      John     200
1      Google     April     220
2        Meta       Wes     190
3       Apple      Beth     130
4      Google    Justin     120
5        Meta     Steph     150

## Group by Corporation - To get object location in memory

In [42]:
# Group by Corporation - To get object location in memory
company = df.groupby("Corporation")
company

 When doing numeric operations on **groupby**, you must pass *numeric_only=True* as argument to the math function (*min*, *max*, *sum*, *std*, ...) but not on *count* or *describe*.
 
 See errors on function calls if *numeric_only* is neccessary or not

## sum

In [43]:
# sum
company.sum(numeric_only=True)

             Salary
Corporation
Apple           330
Google          340
Meta            340

## mean

In [44]:
# mean
company.mean(numeric_only=True)

             Salary
Corporation
Apple         165.0
Google        170.0
Meta          170.0

## max, min

In [45]:
# max min
company.max(numeric_only=True), company.min(numeric_only=True)

(             Salary
 Corporation
 Apple           200
 Google          220
 Meta            190,
              Salary
 Corporation
 Apple           130
 Google          120
 Meta            150)

## standard deviation

In [46]:
# standard deviation
company.std(numeric_only=True)

                Salary
Corporation
Apple        49.497475
Google       70.710678
Meta         28.284271

## variance

In [47]:
# variance
company.var(numeric_only=True)

             Salary
Corporation
Apple        2450.0
Google       5000.0
Meta          800.0

## count

In [48]:
# count
company.count()

             Employees  Salary
Corporation
Apple                2       2
Google               2       2
Meta                 2       2

In [49]:
## describe

In [50]:
# describe
company.describe()

            Salary
             count   mean        std    min    25%    50%    75%    max
Corporation
Apple          2.0  165.0  49.497475  130.0  147.5  165.0  182.5  200.0
Google         2.0  170.0  70.710678  120.0  145.0  170.0  195.0  220.0
Meta           2.0  170.0  28.284271  150.0  160.0  170.0  180.0  190.0